<a href="https://colab.research.google.com/github/marcebalzarelli/Proyecto-Individual-HENRY-N-1-Machine-Learning/blob/main/Limpieza%20de%20Data%20/%20PI_uni%C3%B3n_movies_y_credits.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [4]:
# ABRO DATAFRAME MOVIES
ruta_archivo = '/content/drive/MyDrive/df_movies_limpio.csv'
# Leer el archivo CSV y crear un DataFrame de movies
df_movies = pd.read_csv(ruta_archivo)

In [5]:
df_movies.head(3)

,budget,genres,id,popularity,release_date,revenue,title,vote_average,vote_count,release_year,return,DiaSemana,Mes
0,30000000,"['Animation', 'Comedy', 'Family']",862,21.946943,1995-10-30,373554033.0,Toy Story,7.7,5415.0,1995,12.451801,Lunes,Octubre
1,65000000,"['Adventure', 'Fantasy', 'Family']",8844,17.015539,1995-12-15,262797249.0,Jumanji,6.9,2413.0,1995,4.043035,Viernes,Diciembre
2,0,"['Romance', 'Comedy']",15602,11.712900,1995-12-22,0.0,Grumpier Old Men,6.5,92.0,1995,0.000000,Viernes,Diciembre

In [6]:
# ABRO DATAFRAME CREDITS
ruta_archivo = '/content/drive/MyDrive/df_credits_limpio.csv'
# Leer el archivo CSV y crear un DataFrame de credits
df_credits = pd.read_csv(ruta_archivo)

In [7]:
# Realizo unión de los dataframes
df_merged = pd.merge(df_movies, df_credits, on='id', how='outer')

In [8]:
df_merged.head(3)

,budget,genres,id,popularity,release_date,revenue,title,vote_average,vote_count,release_year,return,DiaSemana,Mes,cast,crew
0,30000000.0,"['Animation', 'Comedy', 'Family']",862,21.946943,1995-10-30,373554033.0,Toy Story,7.7,5415.0,1995.0,12.451801,Lunes,Octubre,"['Tom Hanks', 'Tim Allen', 'Don Rickles', 'Jim...","['John Lasseter', 'Joss Whedon', 'Andrew Stant..."
1,65000000.0,"['Adventure', 'Fantasy', 'Family']",8844,17.015539,1995-12-15,262797249.0,Jumanji,6.9,2413.0,1995.0,4.043035,Viernes,Diciembre,"['Robin Williams', 'Jonathan Hyde', 'Kirsten D...","['Larry J. Franco', 'Jonathan Hensleigh', 'Jam..."
2,0.0,"['Romance', 'Comedy']",15602,11.712900,1995-12-22,0.0,Grumpier Old Men,6.5,92.0,1995.0,0.000000,Viernes,Diciembre,"['Walter Matthau', 'Jack Lemmon', 'Ann-Margret...","['Howard Deutch', 'Mark Steven Johnson', 'Mark..."

In [9]:
##UBICO id COMO PRIMER COLUMNA
# Extraigo la columna específica y la guardo en una variable
columna = df_merged.pop('id')

# Inserto la columna en primer lugar
df_merged.insert(0, 'id', columna)

In [10]:
df_merged.head(3)

,id,budget,genres,popularity,release_date,revenue,title,vote_average,vote_count,release_year,return,DiaSemana,Mes,cast,crew
0,862,30000000.0,"['Animation', 'Comedy', 'Family']",21.946943,1995-10-30,373554033.0,Toy Story,7.7,5415.0,1995.0,12.451801,Lunes,Octubre,"['Tom Hanks', 'Tim Allen', 'Don Rickles', 'Jim...","['John Lasseter', 'Joss Whedon', 'Andrew Stant..."
1,8844,65000000.0,"['Adventure', 'Fantasy', 'Family']",17.015539,1995-12-15,262797249.0,Jumanji,6.9,2413.0,1995.0,4.043035,Viernes,Diciembre,"['Robin Williams', 'Jonathan Hyde', 'Kirsten D...","['Larry J. Franco', 'Jonathan Hensleigh', 'Jam..."
2,15602,0.0,"['Romance', 'Comedy']",11.712900,1995-12-22,0.0,Grumpier Old Men,6.5,92.0,1995.0,0.000000,Viernes,Diciembre,"['Walter Matthau', 'Jack Lemmon', 'Ann-Margret...","['Howard Deutch', 'Mark Steven Johnson', 'Mark..."

In [11]:
nombres_columnas = df_merged.columns

# Imprimir los nombres de las columnas
for columna in nombres_columnas:
    print(columna)

id
budget
genres
popularity
release_date
revenue
title
vote_average
vote_count
release_year
return
DiaSemana
Mes
cast
crew

In [12]:
# Eliminar las filas con valores nulos en la columna cast
df_merged = df_merged.dropna(subset=['cast'])

In [13]:
# Eliminar las filas con valores nulos en la columna crew
df_merged = df_merged.dropna(subset=['crew'])

In [14]:
# Verificar los valores nulos en una columna cast
column_name = 'cast'
null_values = df_merged[column_name].isnull().sum()

# Mostrar el número de valores nulos en la columna
print(f"Número de valores nulos en la columna '{column_name}': {null_values}")

Número de valores nulos en la columna 'cast': 0

In [15]:
# Verificar los valores nulos en una columna crew
column_name = 'crew'
null_values = df_merged[column_name].isnull().sum()

# Mostrar el número de valores nulos en la columna
print(f"Número de valores nulos en la columna '{column_name}': {null_values}")

Número de valores nulos en la columna 'crew': 0

In [16]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 42768 entries, 0 to 45538
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            42768 non-null  int64
 1   budget        42751 non-null  float64
 2   genres        41129 non-null  object
 3   popularity    42751 non-null  float64
 4   release_date  42751 non-null  object
 5   revenue       42751 non-null  float64
 6   title         42751 non-null  object
 7   vote_average  42751 non-null  float64
 8   vote_count    42751 non-null  float64
 9   release_year  42751 non-null  float64
 10  return        42751 non-null  float64
 11  DiaSemana     42751 non-null  object
 12  Mes           42751 non-null  object
 13  cast          42768 non-null  object
 14  crew          42768 non-null  object
dtypes: float64(7), int64(1), object(7)
memory usage: 5.2+ MB

In [17]:
# Guardo el dataset final limpio

df_merged.to_csv('df_final_limpio.csv', index=False)

In [18]:
# GUARDO EN DRIVE EL DATAFRAME FINAL LIMPIO
df_merged.to_csv('/content/drive/MyDrive/df_final_limpio.csv', index=False)